FinPulse/src/Documents/Документ/Документ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Документ</name>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьяДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статус</types>
    </type>
  </attributes>
  <attributes>
    <name>Счёт</name>
    <type>
      <types>CatalogRef.Счёт</types>
    </type>
  </attributes>
  <attributes>
    <name>СчётПолучателя</name>
    <type>
      <types>CatalogRef.Счёт</types>
    </type>
  </attributes>
</mdclass:Document>

FinPulse/src/AccumulationRegisters/ДенежныеСредства/ДенежныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредства</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счёт</name>
    <type>
      <types>CatalogRef.Счёт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьяДДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контраагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДДс</name>
    <type>
      <types>EnumRef.ТипДдс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Измерение</name>
    <type>
      <types>EnumRef.Статус</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

FinPulse/src/AccumulationRegisters/ПланДенежныеСредства/ПланДенежныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПланДенежныеСредства</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счёт</name>
    <type>
      <types>CatalogRef.Счёт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьяДДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

FinPulse/src/Enums/ТипДДС/ТипДДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипДДС</name>
  <enumValues>
    <name>Доход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Перевод</name>
  </enumValues>
</mdclass:Enum>

FinPulse/src/Enums/Статус/Статус.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Статус</name>
  <enumValues>
    <name>План</name>
  </enumValues>
  <enumValues>
    <name>Факт</name>
  </enumValues>
</mdclass:Enum>

FinPulse/src/Documents/Документ/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ДенежныеСредства.Записывать = Истина;
	Движения.ПланДенежныеСредства.Записывать = Истина;
	Статья = СтатьяДДС.ПолучитьОбъект();
	ТипОперации = Статья.ТипДдс;

	// ==========================
	// ДОХОД
	// ==========================
	Если ТипОперации = ПредопределенноеЗначение("Перечисление.ТипДДС.Доход") Тогда

		ДобавитьДвижение(
			ВидДвиженияНакопления.Приход,
			Счёт,
			СтатьяДДС,
			Валюта,
			Сумма,
			Статус);

	// ==========================
	// РАСХОД
	// ==========================
	ИначеЕсли ТипОперации = ПредопределенноеЗначение("Перечисление.ТипДДС.Расход") Тогда

		ДобавитьДвижение(
			ВидДвиженияНакопления.Расход,
			Счёт,
			СтатьяДДС,
			Валюта,
			Сумма,
			Статус);

	// ==========================
	// ПЕРЕВОД
	// ==========================
	ИначеЕсли ТипОперации = ПредопределенноеЗначение("Перечисление.ТипДДС.Перевод") Тогда

		ДобавитьДвижение(
			ВидДвиженияНакопления.Расход,
			Счёт,
			СтатьяДДС,
			Валюта,
			Сумма,
			Статус);
		ДобавитьДвижение(
			ВидДвиженияНакопления.Приход,
			СчётПолучателя,
			СтатьяДДС,
			Валюта,
			Сумма,
			Статус);

	КонецЕсли;

КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
Процедура ДобавитьДвижение(
	ВидДвижения,
	Счёт,
	СтатьяДДС,
	Валюта,
	Сумма,
	Статус)
	Если Статус = ПредопределенноеЗначение("Перечисление.Статус.План") Тогда
		Движение = Движения.ПланДенежныеСредства.Добавить();
	Иначе
		Движение = Движения.ДенежныеСредства.Добавить();
	КонецЕсли;

	Движение.ВидДвижения = ВидДвижения;

	Движение.Период = Дата;
	
	Движение.Дата = Дата;

	Движение.Счёт = Счёт;

	Движение.СтатьяДДС = СтатьяДДС;

	Движение.Валюта = Валюта;

	Движение.Сумма = Сумма;

КонецПроцедуры
#КонецОбласти
